app/views/nursery/_vine_order_fields.html.erb

                <td class="form-group">
                  <%= f.collection_select :variety, Vine.order(:name), :name, :name, include_blank: "Varieties", class: "form-control" %>
---
SELECT "vines".* FROM "vines"  ORDER BY "vines"."name" ASC

                  <td class="form-group">
                  <%= f.collection_select :clone, Clone.order(:name), :name, :name, include_blank: "...", class: "form-control" %>
---
SELECT "clones".* FROM "clones"  ORDER BY "clones"."name" ASC

                  <td class="form-group">
                  <%= f.collection_select :rootstock, Rootstock.order(:name), :name, :name, include_blank: "Own Roots", class: "form-control" %>
---
SELECT "rootstocks".* FROM "rootstocks"  ORDER BY "rootstocks"."name" ASC