app/controllers/nursery_controller.rb

   def varieties
      @class1 = "varieties"
      @vines = Vine.all
      @rootstocks = Rootstock.all
---
SELECT "vines".* FROM "vines"
SELECT "rootstocks".* FROM "rootstocks"

  def review
    @class1 = "order"
    @customer_order = CustomerOrder.find(session[:order])
---
SELECT  "customer_orders".* FROM "customer_orders" WHERE "customer_orders"."id" = ? LIMIT 1  [["id", 2]]
SELECT "vine_orders".* FROM "vine_orders" WHERE "vine_orders"."customer_order_id" = ?  [["customer_order_id", 2]]

  def submit
    @customer_order = CustomerOrder.new(session[:customer_order])
  @params = params
  session.delete(:customer_order)


      if @customer_order.save
---
INSERT INTO "customer_orders" ("business_name", "address", "contact_person", "phone_number", "mobile_number", "email_address", "month", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "vine_orders" ("variety", "clone", "rootstock", "quantity", "potted", "trimmed", "customer_order_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["variety", "Cabernet Sauvignon"], ["clone", "SA125"], ["rootstock", "101-14"], ["quantity", 20], ["potted", "f"], ["trimmed", "f"], ["customer_order_id", 1]]

def for_sectionid

      @clones = Vine.where(name: params[:id]).first.clones
---
SELECT  "vines".* FROM "vines" WHERE "vines"."name" = ?  ORDER BY "vines"."id" ASC LIMIT 1  [["name", "Cabernet Sauvignon"]]

    def set_customer_order
      @customer_order = CustomerOrder.find(params[:id])
---
SELECT  "customer_orders".* FROM "customer_orders" WHERE "customer_orders"."id" = ? LIMIT 1  [["id", 1]]